----- imports
loadstring(exports.importer:load())()
import('RRL_Scripts/usfulS.lua')()    -- Usful Server
import('RRL_Scripts/usfulSh.lua')()    -- Usful Shared
import('Organizations/garage.lua')()
------------------------------------

--------------------
--      int     dim     gar dim (int 1)     ammo dim (int 6)
--lspd   5      64           180                   181
--------------------

enterP = {pos  = Vector3(2505.4104,-1688.2679,12.65157),rot = Vector3(0,0,0),dim = 0,int = 0}
outP = {pos  = Vector3(2355.6582,2442.877,2025.1514),rot = Vector3(0,0,-90),dim = 180,int = 1}
createGerageDoorFunctional(enterP,outP)

----------------------------------Снаружи--------------------------------
-------------------------------------------------------------------------
-----------------------------------LSPD----------------------------------
groovePark1 = createObject(3037, 2503.7817, -1691.0094, 14.06309, 0, 0, 90.5)   setObjectScale(groovePark1, 1.0)
-------------------------------------------------------------------------
spawnCrimePark(180)
spawnBandStorage(181)
----------------------------------Внутри---------------------------------
-------------------------------------------------------------------------
-----------------------------------LSPD----------------------------------
--lspdInt1 = createObject(3089, 222.15251, 68.303, 1005.368, 0, 0, 90)     setElementInterior(lspdInt1, 6)  setElementDimension(lspdInt1, 54)
-------------------------------------------------------------------------

marker = {"cylinder", 1.0, 225, 0, 0, 200}

groove_gar = {
	{331.00757, 1125.8373, 1082.9242, 5, 64},-----------------Вход-----------
	{2367.9229, 2398.7158, 2025.6096, 1, 180},----------------Выход----------
	{2366.752, 2398.7695, 2026.5931, 270, 1, 180},------------Спавн внутри---
	{330.96497, 1124.563, 1083.8828, 180, 5, 64}--------------Спавн снаружи--	
}

groove_storage = {
	{321.18488, 1127.0422, 1082.9028, 5, 64},-----------------Вход-----------
	{2224.2913, 1597.6078, 999.00146, 1, 181},----------------Выход----------
	{2224.4106, 1596.147, 999.97693, 180, 1, 181},------------Спавн внутри---
	{322.62088, 1127.0073, 1083.8828, 90, 5, 64}--------------Спавн снаружи--
}

addVhodVihod(groove_gar, marker)
addVhodVihod(groove_storage, marker)



--"pickup pereod_band" interior="5" posX="311.20633" posY="1124.7035" posZ="1083.8828"
--"mar rab_band"       interior="1" posX="2226.8203" posY="1597.3933" posZ="998.99927"
--"mar oruj_band"      interior="1" posX="2215.9448" posY="1590.6552" posZ="999.02155"
--"marker parki_crime" interior="1" posX="2367.033"  posY="2403.3335" posZ="2025.6342"