----------- Cars Handling ---------------------------------
automobiles = {}
----------------------------------------------------------------------------------------------------

--При импорте урать запятые, 2 элемент и "0x" перед 33 и 34 элементами

-- Rolls Royce Cullinan --
automobiles.LANDSTAL =  {LANDSTAL, 400, 2660, 3100, 2.5, 0, 0.2, -0.3, 85, 0.9, 0.85, 0.5, 5, 310, 25, 220, 'awd', 'petrol', 5, 0.79, false, 45, 0.7, 0.08, 0, 0.28, -0.25, 0.5, 0.25, 0.27, 0.3, 25000, 0x222020, 0x1504802, 0, 1, 0}
-- Mercedes-Benz E124 AMG Coupe --
automobiles.BRAVURA =   {BRAVURA, 401, 1610, 2000, 1.7, 0, 0.1, 0, 70, 0.75, 0.8, 0.45, 5, 309, 18, 137, 'rwd', 'petrol', 5, 0.85, false, 45, 1.3, 0.08, 0, 0.31, -0.15, 0.57, 0, 0.26, 0.5, 9000, 0x220001, 0x1000001, 0, 0, 0}
-- Ford Mustang GT --
automobiles.BUFFALO =   {BUFFALO, 402, 1750, 4000, 0, 0, 0.1, -0.1, 85, 0.8, 0.9, 0.5, 5, 350, 20, 150, 'rwd', 'petrol', 5, 0.6, false, 35, 1.2, 0.12, 0, 0.28, -0.1, 0.5, 0.4, 0.25, 0.3, 35000, 0x222800, 0x1004000, 1, 1, 0}
-- Range Rover SVR --
automobiles.PEREN =     {PEREN, 404, 2310, 2900, 2.5, 0, 0.1, 0, 70, 0.9, 0.9, 0.45, 5, 380, 29, 115, 'awd', 'petrol', 5, 0.9, false, 35, 1, 0.1, 0, 0.5, -0.17, 0.5, 0, 0.2, 0.6, 10000, 0x222020, 0x1004400, 1, 1, 0}
-- Rolls Royce Phantom --
automobiles.SENTINEL =  {SENTINEL, 405, 2625, 3000, 2.2, 0, 0, -0.7, 75, 0.9, 0.8, 0.45, 5, 310, 25, 150, 'rwd', 'petrol', 5, 0.79, false, 45, 1.2, 20, 0, 0.65, -0.15, 0.4, 0, 0.2, 0.3, 35000, 0x222000, 0x1404800, 0, 1, 0}
-- MUCK (Мусоровоз) --
automobiles.TRASH =     {TRASH, 408, 6500, 20500, 5, 0, 0, -0.2, 90, 0.5, 0.9, 0.3, 4, 200, 10, 250, 'rwd', 'petrol', 3.5, 0.79, false, 30, 1, 0.06, 0, 0.45, -0.25, 0.55, 0.3, 0.45, 0.3, 5000, 0x224008, 0x1000200, 0, 1, 0}
-- Mercedes-Benz Maybach --
automobiles.STRETCH =   {STRETCH, 409, 2390, 2815, 1.8, 0, 0.14, -0.5, 75, 0.8, 0.8, 0.45, 5, 310, 22, 210, 'rwd', 'petrol', 4.5, 0.79, false, 40, 0.5, 0.07, 0, 0.2, -0.2, 0.5, 0, 0.2, 0.3, 40000, 0x2A2000, 0x1400001, 1, 1, 0}
-- Mercedes-Benz C63-S --
automobiles.MANANA =    {MANANA, 410, 1700, 2500, 1, 0, 0, -0.1, 70, 1, 0.8, 0.5, 3, 390, 28, 250, 'awd', 'petrol', 5, 0.79, false, 40, 1.2, 0.1, 1, 0.2, -0.1, 0.65, 0.2, 0.26, 0.3, 9000, 0x212000, 0x1004400, 0, 0, 0}
-- Koenigsegg Agera RS --
automobiles.INFERNUS =  {INFERNUS, 411, 1330, 1435, 1.5, 0, 0.1, -0.1, 70, 1.1, 1, 0.4, 5, 521, 50, 100, 'rwd', 'petrol', 5, 0.79, false, 35, 1.2, 0.19, 0, 0.25, -0.1, 0.5, 0.4, 0.37, 0.3, 95000, 0x40222004, 0x1C08800, 1, 1, 1}
--Toyota  AE-86 --
automobiles.VOODOO =    {VOODOO, 412, 905, 1200, 1, 0, 0, -0.3, 70, 0.8, 0.8, 0.45, 4, 250, 9.5, 170, 'rwd', 'petrol', 5, 0.79, false, 40, 1.1, 0.5, 1, 0.2, -0.2, 0.5, 0, 0.22, 0.1, 30000, 0x220000, 0x1008800, 1, 1, 0}
-- Ford Econoline (грузовик) --
automobiles.MULE =      {MULE, 414, 4000, 14000, 4, 0, 0, 0.1, 80, 0.55, 0.85, 0.46, 5, 220, 14, 270, 'rwd', 'petrol', 4.5, 0.6, false, 30, 2, 0.07, 5, 0.3, -0.15, 0.5, 0, 0.46, 0.3, 22000, 0x224088, 0x1004801, 0, 3, 0}
-- Lamborghini Huracan --
automobiles.CHEETAH =   {CHEETAH, 415, 1400, 3000, 1, 0, -0.2, -0.2, 70, 1.9, 0.7, 0.35, 5, 400, 45, 150, 'awd', 'petrol', 5, 0.6, false, 45, 1.5, 0.2, 0, 0.15, -0.03, 0.5, 0.6, 0.4, 0.3, 105000, 0xC0222004, 0x1008000, 0, 0, 1}
-- Chevrolet C4500 (Скорая) --
automobiles.AMBULAN =   {AMBULAN, 416, 6000, 10000, 1, 0, -0, -0.3, 90, 0.8, 0.8, 0.4, 5, 190, 10, 100, 'awd', 'petrol', 2, 0.55, false, 25, 1, 0.07, 100, 0.4, -0.2, 0.5, 0, 0.58, 0.3, 10000, 0x214001, 0x1008805, 0, 1, 13}
--BMW 6 E24 --
automobiles.ESPERANT =   {ESPERANT, 419, 1430, 1850, 2, 0, 0, 0, 70, 0.6, 0.88, 0.5, 5, 274, 15, 190, 'rwd', 'petrol', 5, 0.8, false, 40, 0.8, 0.05, 1, 0.25, -0.13, 0.5, 0, 0.36, 0.54, 19000, 0x40220000, 0x1004400, 0, 3, 0}
-- Ford Crown Victoria (Taxi) --
automobiles.TAXI =      {TAXI, 420, 1900, 2600, 0, 0, 0.3, -0.25, 75, 0.85, 0.9, 0.45, 5, 220, 19, 250, 'rwd', 'petrol', 5, 0.79, false, 45, 1.3, 10, 0, 0.2, -0.12, 0.54, 0, 0.2, 0.3, 20000, 0x232000, 0x1004000, 0, 1, 0}
-- Lamborghini Urus --
automobiles.WASHING =   {WASHING, 421, 2200, 2800, 2.2, 0, 0, -0.1, 75, 1, 0.8, 0.44, 5, 377, 32, 130, 'awd', 'petrol', 5, 0.79, false, 40, 0.9, 0.2, 0, 0.27, -0.15, 0.5, 0.35, 0.24, 0.3, 18000, 0x222000, 0x1404000, 1, 1, 0}
--Ford Sierra --
automobiles.BOBCAT =    {BOBCAT, 422, 1160, 4000, 2.5, 0, 0.05, -0.2, 75, 0.8, 0.85, 0.47, 5, 280, 16, 235, 'rwd', 'petrol', 5, 0.79, false, 35, 1.5, 0.1, 5, 0.35, -0.18, 0.4, 0, 0.26, 0.2, 26000, 0x220040, 0x1004404, 0, 1, 0}
-- BMW X5M --
automobiles.PREMIER =   {PREMIER, 426, 2400, 3100, 1, 0, 0, -0.1, 75, 0.8, 0.9, 0.45, 5, 310, 20, 120, 'awd', 'petrol', 5, 0.79, false, 45, 1, 0.12, 0, 0.28, -0.12, 0.5, 0, 0.2, 0.3, 25000, 0x40222000, 0x1008408, 0, 1, 0}
-- SWAT --
automobiles.SWAT =      {ENFORCER, 427, 5000, 17333.301, 1.8, 0, 0.1, -0.2, 85, 1.05, 0.66, 0.48, 5, 250, 15, 200, 'awd', 'petrol', 2, 0.79, false, 35, 1, 10, 0, 0.55, -0.2, 0.5, 0, 0.32, 0.3, 40000, 0x224001, 0x1002201, 0, 1, 13}
-- Secury Car (Инкассация) --
automobiles.SECURICA =  {SECURICA, 428, 10000, 31000, 1.5, 0, 0, 0, 90, 0.9, 0.7, 0.4, 5, 170, 6, 100, 'awd', 'petrol', 5, 0.79, false, 27, 1, 0.06, 0, 0.35, -0.15, 0.5, 0, 0.27, 0.3, 40000, 0x224001, 0x1008805, 1, 1, 13}
-- BMW Z4 --
automobiles.BANSHEE =   {BANSHEE, 429, 1535, 3400, 2, 0, 0.1, -0.3, 70, 1, 0.8, 0.5, 5, 418, 17, 200, 'rwd', 'petrol', 5, 0.79, false, 40, 1.1, 0.1, 5, 0.3, -0.06, 0.51, 0.3, 0.15, 0.3, 45000, 0x222004, 0x1004000, 1, 1, 1}
-- Bus --
automobiles.BUS =       {BUS, 431, 5500, 33187.898, 0, 0, 0, 0, 90, 1, 0.9, 0.48, 4, 140, 10, 400, 'rwd', 'petrol', 1, 0.79, false, 45, 1.2, 0.07, 0, 0.45, -0.1, 0.45, 0, 0.2, 0.3, 15000, 0x224002, 0x1002401, 1, 1, 16}
-- Caterhem 7 (Exlusive) --
automobiles.HOTKNIFE =  {HOTKNIFE, 434, 550, 1000, 0, 0, 0.1, -0.1, 75, 1, 0.8, 0.45, 5, 240, 20, 30, 'rwd', 'petrol', 5, 0.8, false, 35, 1.1, 0.08, 0, 0.28, -0.2, 0.4, 0.3, 0.2, 0.6, 35000, 0x222000, 0xE9004000, 1, 1, 0}
-- Mini Cooper S --
automobiles.PREVION =   {PREVION, 436, 1400, 3000, 0, 0, 0, -0.1, 70, 0.8, 0.8, 0.45, 4, 291, 18, 190, 'fwd', 'petrol', 5, 0.79, false, 35, 1, 0.08, 0, 0.2, -0.1, 0.55, 0.3, 0.21, 0.5, 9000, 0x210000, 0x1004000, 0, 0, 0}
-- BMW M5 F90 --
automobiles.CABBIE =    {CABBIE, 438, 1865, 4351.7, 2.9, 0, 0.1, -0.3, 75, 0.9, 0.9, 0.55, 5, 670, 28, 250, 'awd', 'petrol', 5, 0.79, false, 40, 1.2, 0.06, 0, 0.25, -0.18, 0.4, 0.5, 0.2, 0.3, 10000, 0x222000, 0x1000000, 1, 1, 0}
-- VolksWagen Ceroke R --
automobiles.STALLION =  {STALLION, 439, 1450, 1810, 2, 0, 0, -0.15, 70, 0.9, 0.75, 0.48, 5, 310, 20, 190, 'fwd', 'petrol', 5, 0.79, false, 35, 1, 0.1, 0, 0.3, -0.15, 0.5, 0, 0.3, 0.64, 19000, 0x212800, 0x1000004, 1, 1, 0}
-- BMW 850 e31 --
automobiles.ROMERO =    {ROMERO, 442, 2739, 3300, 2, 0, 0, 0.2, 70, 0.75, 0.8, 0.5, 5, 310, 20, 190, 'rwd', 'petrol', 5, 0.79, false, 40, 0.8, 0.1, 0, 0.2, -0.08, 0.4, 0, 0.2, 0.3, 10000, 0x40212020, 0x1000000, 0, 1, 0}
-- Kenworth (Перевозчик авто) --
automobiles.PACKER =    {PACKER, 443, 8000, 15000, 2, 0, 0, 0, 90, 0.65, 0.85, 0.35, 5, 140, 5, 100, 'rwd', 'petrol', 3, 0.79, false, 35, 1, 0.04, 0, 0.45, -0.3, 0.5, 0, 0.56, 0.3, 20000, 0x224000, 0x1444801, 0, 1, 2}
-- BMW M5 E38 --
automobiles.ADMIRAL =   {ADMIRAL, 445, 1785, 2300, 2, 0, 0, -0.4, 70, 0.9, 0.7, 0.45, 5, 315, 20, 180, 'rwd', 'petrol', 5, 0.79, false, 40, 0.9, 0.15, 0, 0.2, -0.07, 0.44, 0.55, 0.2, 0.3, 35000, 0x210000, 0x1400000, 0, 1, 0}
-- Lamborghini Sian --
automobiles.TURISMO =   {TURISMO, 451, 1600, 2200, 0, 0, 0, -0.2, 70, 1.4, 0.8, 0.4, 5, 390, 40, 180, 'awd', 'petrol', 5, 0.79, false, 35, 1.2, 20, 0, 0.15, -0.12, 0.5, 0, 0.17, 0.3, 95000, 0x40222004, 0xC00001, 1, 1, 1}
-- Peugeot (Грузовик) --
automobiles.YANKEE =    {YANKEE, 456, 3000, 4500, 3, 0, 0, 0, 80, 0.7, 0.7, 0.4, 5, 198, 12, 250, 'rwd', 'petrol', 3, 0.8, false, 35, 1, 0.12, 0, 0.3, -0.25, 0.5, 0, 0.35, 0.45, 22000, 0x214088, 0x1000001, 0, 1, 0}
-- Toyota Camry --
automobiles.SOLAIR =    {SOLAIR, 458, 1500, 2000, 1, 0, 0, 0, 75, 0.9, 0.8, 0.48, 5, 350, 12, 300, 'fwd', 'petrol', 5, 0.79, false, 35, 1.4, 0.1, 0, 0.4, -0.15, 0.5, 0, 0.24, 0.3, 18000, 0x222000, 0x1004402, 1, 1, 0}
-- Audi RS6 --
automobiles.GLENDALE =  {GLENDALE, 466, 1840, 2150, 1, 0, 0.1, 0, 75, 0.9, 0.9, 0.45, 5, 310, 35, 115, 'awd', 'petrol', 5, 0.79, false, 40, 1.2, 20, 0, 0.2, -0.22, 0.5, 0, 0.23, 0.3, 20000, 0x222000, 0x1800002, 1, 1, 0}
-- BMW M5 E39 --
automobiles.OCEANIC =   {OCEANIC, 467, 1900, 2700, 1, 0, 0, -0.2, 75, 0.9, 0.8, 0.45, 5, 390, 25, 280, 'rwd', 'petrol', 5, 0.79, false, 45, 1, 0.1, 0, 0.35, -0.17, 0.5, 0.5, 0.23, 0.3, 20000, 0x222000, 0x1008401, 2, 1, 0}
-- Hummer H1 --
automobiles.PATRIOT =   {PATRIOT, 470, 2800, 7968.7, 1, 0, 0.2, -0.44, 80, 1, 0.7, 0.45, 5, 180, 10, 400, 'awd', 'petrol', 2, 0.79, false, 45, 1, 0.08, 0, 0.5, -0.35, 0.5, 0, 0.28, 0.3, 40000, 0x210008, 0x1300000, 0, 1, 0}
-- Toyota Supra --
automobiles.HERMES =    {HERMES, 474, 1500, 3000, 2, 0, 0.1, -0.1, 70, 0.9, 0.88, 0.47, 5, 380, 19, 200, 'rwd', 'petrol', 5, 0.79, false, 45, 1, 20, 0, 0.28, -0.1, 0.58, 0, 0.25, 0.3, 19000, 0x222000, 0x1000001, 1, 3, 0}
-- Porsche 911 1995 --
automobiles.SABRE =     {SABRE, 475, 1200, 1800, 0, 0, 0, -0.3, 70, 1, 0.9, 0.45, 5, 370, 30, 120, 'awd', 'petrol', 5, 0.79, false, 35, 1.2, 20, 0, 0.1, -0.08, 0.45, 0, 0.25, 0.3, 19000, 0x220000, 0x1008006, 1, 1, 0}
-- BMW M4 E?? --
automobiles.ZR350 =     {ZR350, 477, 1500, 2200, 1, 0, 0.2, -0.1, 70, 1, 0.8, 0.48, 5, 310, 25, 100, 'rwd', 'petrol', 5, 0.79, false, 45, 1.2, 50, 0, 0.25, -0.1, 0.58, 0, 0.24, 0.3, 45000, 0x222000, 0x1C00001, 1, 1, 0}
-- Honda Accord --
automobiles.REGINA =    {REGINA, 479, 1500, 1950, 2, 0, 0, 0.1, 75, 0.7, 0.85, 0.52, 4, 310, 13.5, 270, 'fwd', 'petrol', 5, 0.6, false, 30, 0.9, 20, 0, 0.27, -0.2, 0.5, 0.2, 0.24, 0.3, 18000, 0x222000, 0x1008001, 1, 1, 0}
-- Ferrari Pista --
automobiles.COMET =     {COMET, 480, 1500, 2500, 1, 0, -0.2, -0.2, 75, 1, 0.8, 0.4, 5, 420, 45, 100, 'rwd', 'petrol', 5, 0.7, false, 55, 1.4, 0.14, 3, 0.28, -0.1, 0.55, 0, 0.25, 0.3, 35000, 0x40222800, 0x1008800, 1, 1, 19}
-- GMC Vandura
automobiles.BURRITO =   {BURRITO, 482, 2260, 3800, 2.5, 0, 0, -0.2, 85, 0.8, 0.87, 0.51, 5, 220, 14, 250, 'rwd', 'petrol', 5, 0.79, false, 35, 1, 0.07, 2, 0.4, -0.25, 0.4, 0.5, 0.2, 0.5, 26000, 0x220001, 0x1408800, 0, 1, 13}
--490 Mercedes-Benz G-klasse 4*4^2 --
automobiles.FBIRANCH =  {FBIRANCH, 490, 3500, 11156.2, 0, 0, 0, -0.5, 80, 1, 0.9, 0.42, 5, 300, 20, 50, 'awd', 'petrol', 5, 0.79, false, 40, 1, 10, 0, 0.65, -0.1, 0.5, 0, 0.44, 0.3, 40000, 0x226020, 0x1600000, 0, 1, 0}
-- Mercedes-Benz 300SL --
automobiles.VIRGO =     {VIRGO, 491, 1295, 2000, 1, 0, 0.1, -0.1, 70, 0.8, 0.8, 0.5, 4, 262, 17, 190, 'rwd', 'petrol', 5, 0.79, false, 40, 0.9, 10, 0, 0.2, -0.18, 0.47, 0, 0.26, 0.3, 9000, 0x220000, 0x1008800, 0, 0, 0}
-- Jeep Grand Cherokee --
automobiles.GREENWOO =  {GREENWOO, 492, 2500, 4500, 1, 0, 0.2, -0.2, 70, 0.9, 0.88, 0.45, 4, 360, 40, 270, 'awd', 'petrol', 5, 0.79, false, 45, 1.1, 0.5, 1, 0.2, -0.1, 0.5, 0, 0.22, 0.3, 19000, 0x222000, 0x1208800, 0, 3, 0}
-- Porsche 911 --
automobiles.HOTRING1 =  {HOTRING1, 494, 1600, 2000, 1.4, 0, 0.2, -0.4, 70, 1.1, 0.8, 0.45, 5, 398, 40, 200, 'awd', 'petrol', 5, 0.79, false, 45, 1.5, 1, 0, 0.18, -0.16, 0.6, 0.4, 0.2, 0.3, 45000, 0x40222004, 0x1C02200, 1, 1, 0}
--497 helicopter
--
-- Mercedes-Benz Sprinter --
automobiles.BOXVILLE =  {BOXVILLE, 498, 2250, 5700, 3, 0, -0.5, 0.1, 80, 0.9, 0.7, 0.46, 5, 180, 20, 300, 'awd', 'petrol', 3, 0.6, false, 30, 0.9, 0.08, 0, 0.25, -0.2, 0.35, 0.6, 0.26, 0.3, 22000, 0x220009, 0x1008801, 0, 3, 13}
-- Mitsubishi Fuso -- под замену
automobiles.BENSON =    {BENSON, 499, 2820, 8500, 2.3, 0, -0.6, 0, 80, 0.9, 0.7, 0.46, 5, 135, 15, 350, 'awd', 'petrol', 3, 0.6, false, 30, 1.2, 0.2, 0, 0.35, -0.15, 0.45, 0, 0.46, 0.3, 22000, 0x220008, 0x1000001, 1, 3, 0}
-- Jeep Wrangler --
automobiles.MESA =      {MESA, 500, 1800, 3000, 3, 0, 0.2, -0.3, 85, 1.2, 0.7, 0.45, 5, 225, 17, 200, 'awd', 'petrol', 5, 0.79, false, 50, 1.2, 0.08, 0, 0.9, -0.27, 0.4, 0, 0.18, 0.3, 25000, 0x220840, 0x1000000, 0, 1, 0}
-- Audi R8 --
automobiles.HOTRING2 =  {HOTRING3, 502, 1525, 1630, 1.4, 0, 0.2, -0.1, 70, 1.2, 0.8, 0.4, 5, 421, 30, 120, 'awd', 'petrol', 5, 0.79, false, 35, 1.4, 0.1, 10, 0.29, -0.06, 0.6, 0.4, 0.2, 0.3, 45000, 0x40222004, 0x1C00200, 1, 1, 0}
-- Ferrari F12 --
automobiles.HOTRING3 =  {HOTRING2, 503, 1600, 2500, 1.4, 0, 0.1, -0.1, 70, 1.2, 0.9, 0.4, 5, 398, 25, 130, 'rwd', 'petrol', 5, 0.79, false, 30, 1.4, 20, 0, 0.2, -0.04, 0.6, 0.4, 0.2, 0.3, 45000, 0x40222004, 0x1C00000, 1, 1, 0}
-- Lamborghini Aventador --
automobiles.SUPERGT =   {SUPERGT, 506, 1579, 1600, 2, 0, -0.05, -0.4, 70, 1.1, 0.9, 0.45, 5, 434, 40, 100, 'awd', 'petrol', 5, 0.79, false, 35, 1, 0.2, 0, 0.25, -0.1, 0.5, 0.3, 0.4, 0.3, 105000, 0x40222004, 0x1208800, 0, 0, 1}
-- BMW 7 --
automobiles.ELEGANT =   {ELEGANT, 507, 2000, 2700, 1.8, 0, -0.1, -0.1, 75, 0.8, 0.88, 0.5, 5, 308, 20, 250, 'awd', 'petrol', 4, 0.79, false, 43, 1, 0.1, 0, 0.3, -0.15, 0.5, 0.1, 0.2, 0.3, 35000, 0x222000, 0x1400000, 0, 1, 0}
--515
--
-- Skoda Octavia --
automobiles.NEBULA =    {NEBULA, 516, 1444, 1938, 2, 0, 0.2, -0.1, 75, 0.8, 0.88, 0.5, 5, 330, 18, 200, 'fwd', 'petrol', 5, 0.79, false, 43, 1, 0.1, 0, 0.27, -0.09, 0.58, 0.3, 0.2, 0.3, 35000, 0x222000, 0x1400000, 0, 1, 0}
-- Lexus RCF --
automobiles.MAJESTIC =  {MAJESTIC, 517, 1765, 2250, 2.2, 0, 0.1, -0.1, 75, 1, 0.8, 0.5, 5, 334, 33, 120, 'rwd', 'petrol', 5, 0.85, false, 40, 1.4, 0.13, 0, 0.27, -0.04, 0.5, 0.3, 0.2, 0.3, 35000, 0x622000, 0x1400000, 0, 1, 0}
-- BMW M2 --
automobiles.CADRONA =   {CADRONA, 527, 1600, 3500, 1, 0, 0.1, -0.3, 70, 0.9, 0.9, 0.45, 5, 310, 30, 150, 'rwd', 'petrol', 4, 0.6, false, 40, 1.3, 0.12, 0, 0.2, -0.12, 0.5, 0, 0.26, 0.3, 9000, 0x40222000, 0x1008802, 0, 0, 0}
-- Mercedes-Benz E63 S --
automobiles.WILLARD =   {WILLARD, 529, 2000, 2700, 0, 0, 0, -0.2, 70, 1, 0.9, 0.5, 5, 310, 25, 100, 'awd', 'petrol', 5, 0.79, false, 40, 1, 0.15, 0, 0.2, -0.02, 0.4, 0, 0.26, 0.3, 19000, 0x40222000, 0x1004402, 0, 3, 0}
-- Bentley Mullinier --
automobiles.FELTZER =   {FELTZER, 533, 2420, 2430, 2.5, 0, 0.3, -0.3, 75, 0.8, 0.8, 0.47, 5, 450, 42, 300, 'awd', 'petrol', 5, 0.79, false, 35, 1, 0.09, 0, 0.3, -0.1, 0.5, 0.3, 0.25, 0.3, 35000, 0x40222800, 0x1004400, 1, 1, 19}
-- Mercedes-Benz GT63 --
automobiles.VINCENT =   {VINCENT, 540, 2200, 2700, 0, 0, 0.3, -0.2, 70, 0.95, 0.9, 0.48, 5, 520, 27, 180, 'awd', 'petrol', 5, 0.79, false, 45, 1.2, 10, 0, 0.2, -0.1, 0.65, 0, 0.26, 0.3, 19000, 0x222000, 0x1004002, 0, 3, 0}
-- Bugatti Chiron --
automobiles.BULLET =    {BULLET, 541, 2000, 4000, 1.8, 0, -0.15, -0.3, 70, 2, 0.7, 0.4, 5, 520, 50, 100, 'awd', 'petrol', 5, 0.79, false, 30, 1, 0.13, 5, 0.25, -0.1, 0.45, 0.3, 0.15, 0.3, 105000, 0xC0222004, 0x1000003, 0, 0, 1}
-- Dodge Charger SRT --
automobiles.CLOVER =    {CLOVER, 542, 1950, 2400, 2.2, 0, 0, 0, 70, 1, 0.8, 0.55, 5, 426, 26, 160, 'rwd', 'petrol', 5, 0.79, false, 40, 1, 3, 0, 0.3, -0.26, 0.5, 0.25, 0.25, 0.3, 19000, 0x402A2080, 0x1004000, 1, 1, 0}
-- Mitsubishi Lancer X --
automobiles.INTRUDER =  {INTRUDER, 546, 1560, 2040, 1, 0, 0.2, -0.2, 70, 0.9, 0.8, 0.5, 5, 313, 24, 150, 'awd', 'petrol', 5, 0.79, false, 30, 0.9, 0.09, 0, 0.2, -0.13, 0.54, 0, 0.26, 0.3, 19000, 0x222000, 0x1008802, 0, 3, 0}
-- BMW M8 --
automobiles.PRIMO =     {PRIMO, 547, 2000, 2600, 2.2, 0, 0.2, -0.1, 70, 0.9, 0.75, 0.5, 4, 312, 22, 120, 'awd', 'petrol', 5, 0.79, false, 35, 1, 0.14, 0, 0.2, -0.07, 0.55, 0, 0.26, 0.3, 19000, 0x222000, 0x1008800, 0, 3, 0}
-- Mercedes-Benz AMG GT --
automobiles.TAMPA =     {TAMPA, 549, 1700, 2000, 0, 0, 0.15, -0.1, 70, 1.2, 0.9, 0.5, 5, 700, 25, 150, 'rwd', 'petrol', 5, 0.79, false, 35, 1.4, 10, 0, 0.1, -0.04, 0.4, 0, 0.3, 0.3, 19000, 0x222004, 0x1000003, 1, 1, 1}
-- Porsche Panamera --
automobiles.SUNRISE =   {SUNRISE, 550, 2100, 3600, 0, 0, 0.1, -0.4, 70, 1.1, 0.8, 0.5, 5, 500, 25, 190, 'awd', 'petrol', 5, 0.79, false, 50, 1.1, 100, 0, 0.2, -0.2, 0.45, 0, 0.26, 0.3, 19000, 0x222000, 0x1000000, 0, 3, 0}
-- KIA Stinger --
automobiles.MERIT =     {MERIT, 551, 1800, 2500, 1, 0, 0.1, -0.2, 75, 0.85, 0.8, 0.48, 5, 450, 21, 250, 'awd', 'petrol', 5, 0.79, false, 45, 0.9, 0.15, 0, 0.12, -0.1, 0.54, 0.3, 0.2, 0.3, 35000, 0x40222000, 0x1000001, 0, 1, 0}
-- Shevrolet Silverado (Электромонтажник) --
automobiles.UTILITY =   {UTILITY, 552, 2600, 8666.7, 3, 0, 0, 0, 80, 0.85, 0.7, 0.46, 5, 160, 7.2, 10, 'rwd', 'petrol', 4.5, 0.79, false, 30, 1.8, 0.07, 0, 0.35, -0.18, 0.25, 0, 0.2, 0.3, 20000, 0x222001, 0x1200800, 0, 3, 13}
-- Shevrolet Corvette --
automobiles.WINDSOR =   {WINDSOR, 555, 1600, 2200, 0, 0, 0.01, -0.1, 75, 1.2, 0.8, 0.43, 5, 500, 50, 120, 'rwd', 'petrol', 5, 0.79, false, 35, 1.1, 1, 0, 0.15, -0.01, 0.55, 0.3, 0.25, 0.3, 35000, 0x402A2804, 0x1000200, 1, 1, 1}
-- Nissan GTR --
automobiles.URANUS =    {URANUS, 558, 1700, 2200, 2, 0, 0.1, -0.2, 75, 1, 0.8, 0.5, 5, 395, 30, 150, 'awd', 'petrol', 5, 0.79, false, 45, 1.2, 1, 0, 0.2, -0.08, 0.38, 0, 0.25, 0.3, 35000, 0xC0222000, 0x5000001, 1, 1, 0}
-- BMW M4 E?? --
automobiles.JESTER =    {JESTER, 559, 1600, 2400, 1, 0, 0.1, -0.1, 75, 1, 0.9, 0.55, 5, 530, 28, 190, 'rwd', 'petrol', 5, 0.79, false, 45, 1.3, 0.8, 0, 0.15, -0.15, 0.6, 0, 0.25, 0.3, 35000, 0xC0222004, 0x5004400, 1, 1, 1}
-- BMW M3 E?? --
automobiles.SULTAN =    {SULTAN, 560, 1700, 2200, 1, 0, 0.1, -0.2, 75, 1.2, 0.85, 0.52, 5, 420, 22, 120, 'awd', 'petrol', 5, 0.79, false, 45, 1.1, 20, 0, 0.12, -0.1, 0.45, 0, 0.25, 0.3, 35000, 0x222800, 0x5000002, 1, 1, 0}
-- VolksWagen Golf --
automobiles.STRATUM =   {STRATUM, 561, 1351, 1600, 2.1, 0, 0.1, -0.1, 75, 0.9, 0.9, 0.45, 5, 305, 20, 210, 'fwd', 'petrol', 5, 0.79, false, 40, 1.2, 0.15, 0, 0.28, -0.16, 0.5, 0.3, 0.25, 0.3, 35000, 0x222800, 0x5000000, 1, 1, 0}
-- BMW M3 E?? --
automobiles.ELEGY =     {ELEGY, 562, 1600, 2100, 2.2, 0, 0.3, -0.15, 75, 0.9, 0.9, 0.53, 5, 310, 25, 150, 'rwd', 'petrol', 5, 0.7, false, 35, 1, 0.8, 0, 0.2, -0.1, 0.5, 0.3, 0.25, 0.3, 35000, 0x40222804, 0x5008801, 1, 1, 1}
-- Ferrari 812 Superfast --
automobiles.FLASH =     {FLASH, 565, 1500, 2200, 1, 0, 0.2, -0.1, 75, 1.2, 0.8, 0.5, 5, 420, 45, 140, 'rwd', 'petrol', 6, 0.7, false, 30, 1.4, 0.23, 0, 0.2, -0.18, 0.5, 0.3, 0.25, 0.3, 35000, 0x222004, 0x5008801, 1, 1, 1}
-- Mercedes-Benz E63 --
automobiles.TAHOMA =    {TAHOMA, 566, 1940, 2415, 2.3, 0, -0.02, -0.1, 75, 0.9, 0.85, 0.5, 5, 333, 22, 110, 'awd', 'petrol', 5, 0.79, false, 40, 0.8, 0.08, 0.2, 0.1, -0.2, 0.45, 0.3, 0.25, 0.3, 35000, 0x222000, 0x13010000, 1, 1, 0}
--!! Cadillac Escalate --
automobiles.SAVANNA =    {SAVANNA, 567, 2200, 2750, 2, 0, 0, 0, 70, 0.75, 0.8, 0.5, 5, 220, 22, 140, 'awd', 'petrol', 5, 0.79, false, 40, 0.9, 2, 0, 0.4, -0.19, 0.55, 0, 0.2, 0.3, 19000, 0x40222000, 0x1004400, 1, 1, 0}
--574 Sweeper
--
-- Mercedes-Benz G63 --
automobiles.HUNTLEY =   {HUNTLEY, 579, 3150, 3500, 2.5, 0, 0, -0.2, 10, 0.8, 0.89, 0.5, 5, 272, 30, 200, 'awd', 'petrol', 4.7, 0.79, false, 40, 1, 2, 0, 0.3, -0.18, 0.45, 0.3, 0.44, 0.3, 40000, 0x222020, 0x1000007, 0, 1, 0}
-- Mercedes-Benz W140 --
automobiles.STAFFORD =  {STAFFORD, 580, 2200, 3000, 0, 0, 0.1, -0.1, 75, 0.9, 0.9, 0.54, 5, 420, 21, 220, 'rwd', 'petrol', 5, 0.79, false, 45, 1, 2, 0, 0.2, -0.05, 0.45, 0.3, 0.2, 0.3, 35000, 0x220000, 0x1400000, 0, 1, 0}
-- Audi A6 --
automobiles.EMPEROR =   {EMPEROR, 585, 1900, 2600, 1, 0, -0.1, 0, 75, 0.9, 0.9, 0.5, 5, 310, 25, 130, 'awd', 'petrol', 5, 0.7, false, 40, 0.9, 0.13, 3, 0.3, -0.1, 0.5, 0.3, 0.2, 0.3, 35000, 0x40222000, 0x1400000, 0, 1, 0}
-- Ferrari Roma --
automobiles.EUROS =     {EUROS, 587, 1472, 1664, 2.2, 0, 0.03, -0.25, 75, 1, 0.9, 0.45, 5, 402, 34, 90, 'rwd', 'petrol', 5, 0.79, false, 34, 1.2, 0.15, 2, 0.3, -0.09, 0.5, 0.3, 0.25, 0.3, 35000, 0x40222804, 0x1000000, 1, 1, 0}
-- Police Lamborghini Aventador --
automobiles.POLICE_LA = {POLICE_LA, 596, 2000, 2500, 2, 0, 0, -0.2, 75, 1.2, 0.9, 0.45, 5, 530, 43, 120, 'awd', 'petrol', 5, 0.79, false, 40, 1.1, 2, 0, 0.28, -0.12, 0.55, 0, 0.2, 0.3, 25000, 0x40222000, 0x11200008, 0, 1, 0}
-- Police Dodge Jeep --
automobiles.POLICE_SF = {POLICE_SF, 597, 3000, 3600, 2, 0, 0.3, -0.1, 75, 1, 0.85, 0.47, 5, 330, 30, 150, 'awd', 'petrol', 6, 0.79, false, 40, 1, 2, 0, 0.3, -0.17, 0.55, 0, 0.2, 0.3, 25000, 0x40222000, 0x11208808, 0, 1, 0}
-- Police Dodge Charger --
automobiles.POLICE_VG = {POLICE_VG, 598, 2300, 3000, 2, 0, 0.3, -0.1, 75, 1.1, 0.9, 0.45, 5, 400, 31, 140, 'rwd', 'petrol', 5, 0.79, false, 45, 1, 1.2, 0, 0.5, -0.1, 0.55, 0, 0.2, 0.3, 25000, 0x40222000, 0x1208809, 0, 1, 0}
-- Police Ford Mustang GT --
automobiles.POLRANGER = {POLRANGER, 599, 2200, 4000, 0, 0, 0.3, -0.4, 85, 1.1, 0.8, 0.45, 5, 560, 40, 110, 'rwd', 'petrol', 5, 0.79, false, 40, 0.9, 5, 20, 0.1, -0.14, 0.5, 0, 0.25, 0.3, 25000, 0x222800, 0x1200202, 0, 1, 0}
-- Mercedes-Benz C63 --
automobiles.ALPHA =     {ALPHA, 602, 1655, 3400, 2, 0, 0.1, -0.2, 85, 0.9, 0.8, 0.47, 5, 308, 19, 1, 'rwd', 'petrol', 5, 0.79, false, 40, 1.2, 0.12, 0.5, 0.2, -0.08, 0.5, 0.4, 0.25, 0.3, 35000, 0x40222800, 0x1004000, 1, 1, 0}
-- Nissan Skyline --
automobiles.PHOENIX =   {PHOENIX, 603, 1285, 1600, 1, 0, 0.2, -0.5, 85, 0.9, 0.9, 0.47, 5, 272, 20, 135, 'rwd', 'petrol', 5, 0.79, false, 30, 0.7, 0.15, 0, 0.2, -0.19, 0.55, 0, 0.25, 0.3, 35000, 0x222800, 0x1008800, 1, 1, 0}

--При импорте урать запятые, 2 элемент и "0x" перед 33 и 34 элементами

--SAVANNA 2739 3300 2 0 -0 0.2 70 0.75 0.8 0.5 5 210 22 180 4 p 5 0.79 false 40 0.8 0.1 0 0.2 -0.08 0.4 0 0.2 1.25 10000 40000020 1000000 0 1 0

function setHandl(avto)
-----------------------------------------------------------------------------
			setModelHandling(avto[2],"mass", avto[3])							        -- масса
			setModelHandling(avto[2],"turnMass", avto[4])						        -- масса толчка
			setModelHandling(avto[2],"dragCoeff", avto[5])						        -- сила рывка
			setModelHandling(avto[2],"centerOfMass", {avto[6], avto[7], avto[8]})	    -- центр масс
			setModelHandling(avto[2],"percentSubmerged", avto[9])				        -- % погружения в воду
			setModelHandling(avto[2],"tractionMultiplier", avto[10])				    -- сцепление с дорогой
			setModelHandling(avto[2],"tractionLoss", avto[11])					        -- потеря сцепления
			setModelHandling(avto[2],"tractionBias", avto[12])					        -- смещение сцепления
			setModelHandling(avto[2],"numberOfGears", avto[13])					        -- количество передач
			setModelHandling(avto[2],"maxVelocity", avto[14])					        -- максимальная скорость
			setModelHandling(avto[2],"engineAcceleration", avto[15])				    -- ускорение
			setModelHandling(avto[2],"engineInertia", avto[16])					        -- инерция
			setModelHandling(avto[2],"driveType", avto[17])					            -- привод ('rwd' - задний; 'fwd' - передний; 'awd' - полный)
			setModelHandling(avto[2],"engineType", avto[18])				            -- 'petrol', 'diesel' or 'electric'
			setModelHandling(avto[2],"brakeDeceleration", avto[19])				        -- замедление торможением
			setModelHandling(avto[2],"brakeBias", avto[20])						        -- смещение тормоза
			setModelHandling(avto[2],"ABS", avto[21])                                   -- ABS (не работает, выставлять false)
			setModelHandling(avto[2],"steeringLock", avto[22])				        	-- угол поворота руля
			setModelHandling(avto[2],"suspensionForceLevel", avto[23])		            -- сила подвески
			setModelHandling(avto[2],"suspensionDamping", avto[24])                     -- даже "цербер" без понятия
			setModelHandling(avto[2],"suspensionHighSpeedDamping", avto[25])            -- демпфирование подвески
			setModelHandling(avto[2],"suspensionUpperLimit", avto[26])                  -- макс. изменение подвески
			setModelHandling(avto[2],"suspensionLowerLimit", avto[27])			        -- высота подвески (в статике)
			setModelHandling(avto[2],"suspensionFrontRearBias", avto[28])		        -- подвеска спереди/сзади
			setModelHandling(avto[2],"suspensionAntiDiveMultiplier", avto[29])          -- крен кузова при разгоне/торможении
			setModelHandling(avto[2],"seatOffsetDistance", avto[30])                    -- хуета (не трогать)
			setModelHandling(avto[2],"collisionDamageMultiplier", 0.3)		            -- урон
			setModelHandling(avto[2],"monetary", avto[32])                              -- типа цена в гта (хуя се)
			setModelHandling(avto[2],"modelFlags", avto[33])
			setModelHandling(avto[2],"handlingFlags", avto[34])	
	-----------------------------------------------------------------------------
end

for marka, auto in pairs(automobiles) do
	setHandl(auto)
end
