--- oop oop s`sound a police
----- imports
loadstring(exports.importer:load())()
import('RRL_Scripts/usfulS.lua')()    -- Usful Server
import('RRL_Scripts/usfulSh.lua')()    -- Usful Shared
import('Organizations/garage.lua')()
------------------------------------

--------------------
--      int     dim     gar dim (int 1)     ammo dim (int 6)
--sfpd   10      55           505                   506
--------------------

enterP = {pos  = Vector3(203.78136,1869.5898,12.68471),rot = Vector3(0,0,0),dim = 0,int = 0}
outP = {pos  = Vector3(2326.0166,2450.9727,1999.7018),rot = Vector3(0,0,-90),dim = 505,int = 1}
createGerageDoorFunctional(enterP,outP)

----------------------------------Снаружи--------------------------------
-------------------------------------------------------------------------
-----------------------------------SFPD----------------------------------
lvArmy1 = createObject(3037, 199.78136, 1869.5898, 12.68471, 0, 0, 0)
lvArmy2 = createObject(1499, 238.53722, 1861.3065, 7.75781, 0, 0, 90) setElementFrozen(lvArmy2, true)
lvArmy3 = createObject(1499, 263.55453, 1871.304, 7.75781, 0, 0, 90)  setElementFrozen(lvArmy3, true)

-------------------------------------------------------------------------
spawnGosPark(505)
spawnGosAmmo(506)
----------------------------------Внутри---------------------------------
-------------------------------------------------------------------------
-----------------------------------SFPD----------------------------------
--lvArmyIn1 =  createObject(3089, 264.46851, 115.82237, 1004.9462, 0, 0, 0)    setElementInterior(sfpdIntk1, 10)   setElementDimension(sfpdIntk1, 55)

-------------------------------------------------------------------------
-------------------------------------------------------------------------

marker = {"cylinder", 1.0, 225, 225, 225, 200}

police_sf_gar = {
	{239.11522, 1862.0459, 7.77648, 0, 0},----------------Вход-----------
	{2352.8164, 2376.623, 1991.0834, 1, 505},-----------------Выход----------
	{2352.9036, 2378.4375, 1992.0759, 180, 1, 505},-----------Спавн внутри---
	{240.61346, 1861.9338, 8.75781, 270, 0, 0}------------Спавн снаружи--	
}

police_sf_ammo = {
	{262.95239, 1872.0352, 7.78005, 0, 0},-------Вход---------------
	{318.34863, -192.52441, 999.77271, 6, 506},--------Выход-------------
	{318.46875, -191.37695, 1000.7569, 0, 6, 506},--------Спавн внутри---
	{261.83606, 1872.0459, 8.75781, 90, 0, 0}--------Спавн снаружи--	
}

addVhodVihod(police_sf_gar, marker)
addVhodVihod(police_sf_ammo, marker)



--"mar rab_sfpd"         interior="10" posX="259.49759" posY="109.66575"  posZ="1002.2303"

--"pickup pereod_armyLV" interior="0"  posX="249.25131" posY="1858.0089"  posZ="13.09865"
--"marker oruj_gos"      interior="6"  posX="314.23053" posY="-188.63576" posZ="999.78418"
--"marker avto_gos"      interior="1"  posX="2348.5078" posY="2378.9021"  posZ="1991.1016"